Revit 2027 API
PanelScheduleView.IsColumnInLoadSummary Method
 Check if this column in the load summary
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsColumnInLoadSummary(
	int nCol
)
Public Function IsColumnInLoadSummary (
	nCol As Integer
) As Boolean
public:
bool IsColumnInLoadSummary(
	int nCol
)
member IsColumnInLoadSummary :
        nCol : int -> bool
Parameters
nCol Int32
 Column Number
Return Value
Boolean
 Check if this column in the load summary
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace